Repository: yvesat/shop
Catalog: lib/l10n/app_*.arb
Languages: pt

# language
source: English
pt: Portuguease

source: Password
pt: Senha

source: Confirm Password
pt: Confirmar Senha

source: SIGN UP
pt: CADASTRAR

source: LOG IN
pt: ENTRAR

source: Version
pt: Versão

# alreadyHaveAccount
source: Already have an account? Log in instead.
pt: Já tem uma conta? Entre aqui.

# dontHaveAccount
source: Don't have an account? Create one here.
pt: Não tem uma conta ainda? Crie aqui.

# cartItemQuantity
source: Quantity: {quantity}
pt: Quantidade: {quantity}

# cartItemTotalPrice
source: Total Price: {price}
pt: Valor Total: {price}

source: Place Order
pt: Confirmar Pedido

# confirmPlaceOrder
source: Confirm order?
pt: Confirmar pedido?

source: Order placed!
pt: Pedido realizado!

source: {item} added to cart!
pt: {item} adicionado ao carrinho!

# logOutFromAppConfirmation
source: Log out from the app?
pt: Sair do app?

# errorNoEMail
source: Please enter your e-mail
pt: Favor inserir seu e-mail

# errorNoPassword
source: Please enter a password
pt: Favor inserir sua senha

# errorUserNotFound
source: No user found for that email
pt: Nenhum usuário cadastrado no e-mail informado

# errorWrongPassword
source: Wrong password provided for that user
pt: Senha incorreta para o usuário cadastrado

# errorInvalidEMailFormat
source: Invalid e-mail format
pt: Formato inválido de e-mail

# errorPasswordTooShort
source: Password must be at least 6 characters long
pt: Sua senha deve conter no mínimo 6 caracteres

# errorNoConfirmationPassword
source: Please confirm your password
pt: Por favor confirme sua senha

# errorPasswordNoMatch
source: Passwords do not match
pt: As senhas informadas não coincidem

# errorWeakPassword
source: The password provided is too weak.
pt: A senha informada é muito fraca

# errorEMailAlreadyUsed
source: The account already exists for that email.
pt: Esse e-mail já foi cadastrado para outra conta

source: Error
pt: Erro

source: CANCEL
pt: CANCELAR

source: Confirmation
pt: Confirmação

source: CONFIRM
pt: CONFIRMAR

source: Success
pt: Sucesso

# searchProduct
source: Search a product
pt: Procure um produto

# updatedProductsWarning
source: Some items that were in your cart have been updated, check the changes before completing your purchase. Updated items: {productList}
pt: Alguns itens que estavam no seu carrinho foram atualizados. Verifique as alterações antes de concluir sua compra. Itens atualizados: {productList}

# removedProductsWarning
source: Some items that were in your cart are no longer available. Unavailable items: {productList}
pt: Alguns itens que estavam no seu carrinho não estão mais disponíveis. Itens indisponíveis: {productList}

# updatedAndRemovedProductsWarning
source: Some items that were in your cart are no longer available or have been updated. Removed items: {removedProductList} Updated items: {updatedProductList}
pt: Alguns itens que estavam no seu carrinho não estão mais disponíveis ou foram atualizados. Itens removidos: {removedProductList} Itens atualizados: {updatedProductList}
